Autodesk.Revit.UI.RevitCommandId.LookupCommandId(System.String)
Looks up and retrieves the Revit command id with the given id string.
name: The Revit command name. Refer to the entries in the Revit journal to find
the string to use for a particular command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when name is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the given name is empty.
Returns:  The Revit command id. Returning null if a command with the given name was not found.
Since: 2013

Autodesk.Revit.UI.RevitCommandId.HasBinding
Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command.
Remarks:  This will not indicate if one or more applications have subscribed to the BeforeExecuted event, as this event is not limited
to a single subscriber
Since: 2013

Autodesk.Revit.UI.RevitCommandId.CanHaveBinding
Indicates whether the command can be assigned a binding to an external add-in..
Since: 2013

Autodesk.Revit.UI.RevitCommandId.Id
The command id.
Since: 2013

Autodesk.Revit.UI.RevitCommandId.Name
The command name.
Since: 2013

Autodesk.Revit.UI.RevitCommandId
Represents a command id in Autodesk Revit.
Remarks:  Each Revit command is assigned a command id and non-localized name.
This class allows you to look up a command by its name, and represents any Revit
command in the use of an AddInCommandBinding.
Since: 2013